"""
已经建立文本文件abc.txt，编写一个程序，统计并输出文件中元音字母出现的次数。

---------------------------------------------------------------------------
输入格式:
数据格式见abc.txt

输出格式:
元音字母出现的?次
---------------------------------------------------------------------------
输入样例1:
见abc.txt
输出样例1:
元音字母出现的191次
-----------------------------------------------------------------
以上是题目，不要更改，从下面开始答题！！！

样例1: 测试失败(同sample)

"""
with open("abc.txt", 'r', encoding='utf-8') as fil:
    txt = fil.read()
aeiou = "aeiouAEIOU"
count = 0
for cha in txt:
    if cha in aeiou:
        count += 1
print("元音字母出现的%d次" % count)
